// Задание 2. Лекция 1 по CSharp
Console.Write("Введите имя ");
string? username = Console.ReadLine();
Console.Write("Привет, ");
Console.Write(username); 
